tuannusi/nrf24L01-stm32-non-Exti/transimt2/Project/main.c
// This is simple transmitter (to one logic address):
	//   - TX address: '0xE7 0x1C 0xE3'
	//   - payload: 5 bytes
	//   - RF channel: 115 (2515MHz)
	//   - data rate: 250kbps (minimum possible, to increase reception reliability)
	//   - CRC scheme: 2 byte

    // The transmitter sends a 5-byte packets to the address '0xE7 0x1C 0xE3' without Auto-ACK (ShockBurst disabled)

    // Disable ShockBurst for all RX pipes
    nRF24_DisableAA(0xFF);

    // Set RF channel
    nRF24_SetRFChannel(115);

    // Set data rate
    nRF24_SetDataRate(nRF24_DR_250kbps);

    // Set CRC scheme
    nRF24_SetCRCScheme(nRF24_CRC_2byte);

    // Set address width, its common for all pipes (RX and TX)
    nRF24_SetAddrWidth(3);

    // Configure TX PIPE
    static const uint8_t nRF24_ADDR[] = { 0xE7, 0x1C, 0xE3 };
    nRF24_SetAddr(nRF24_PIPETX, nRF24_ADDR); // program TX address

    // Set TX power (maximum)
    nRF24_SetTXPower(nRF24_TXPWR_0dBm);

    // Set operational mode (PTX == transmitter)
    nRF24_SetOperationalMode(nRF24_MODE_TX);

    // Clear any pending IRQ flags
    nRF24_ClearIRQFlags();

    // Wake the transceiver
    nRF24_SetPowerMode(nRF24_PWR_UP);
		
		
////////////////////////RX///////////////////////////////////
		
	 // Disable ShockBurst for all RX pipes
    nRF24_DisableAA_1(0xFF);

    // Set RF channel
    nRF24_SetRFChannel_1(118);

    // Set data rate
    nRF24_SetDataRate_1(nRF24_DR_250kbps);

    // Set CRC scheme
    nRF24_SetCRCScheme_1(nRF24_CRC_2byte);

    // Set address width, its common for all pipes (RX and TX)
    nRF24_SetAddrWidth_1(3);

    // Configure RX PIPE#1
    static const uint8_t nRF24_ADDR_1[] = { 0xE6, 0x1B, 0xE2 };
    nRF24_SetAddr_1(nRF24_PIPE1, nRF24_ADDR_1); // program address for RX pipe #1
    nRF24_SetRXPipe_1(nRF24_PIPE1, nRF24_AA_OFF, 5); // Auto-ACK: disabled, payload length: 5 bytes

    // Set operational mode (PRX == receiver)
    nRF24_SetOperationalMode_1(nRF24_MODE_RX);

    // Wake the transceiver
    nRF24_SetPowerMode_1(nRF24_PWR_UP);

    // Put the transceiver to the RX mode
    nRF24_CE_H_1();
		
////////////////////////RX///////////////////////////////////


    // The main loop
    j = 0;
    payload_length = 5;
    while (1) {
    	// Prepare data packet
    	for (i = 0; i < payload_length; i++) {
    		nRF24_payload_tx[i] = 'T';
    	}

    	// Print a payload
//    	UART_SendStr("PAYLOAD:>");
//    	UART_SendBufHex((char *)nRF24_payload_tx, payload_length);
//    	UART_SendStr("< ... TX: ");

    	// Transmit a packet
    	tx_res = nRF24_TransmitPacket(nRF24_payload_tx, payload_length);
    	switch (tx_res) {
			case nRF24_TX_SUCCESS:
				UART_SendStr("OK");
				break;
			case nRF24_TX_TIMEOUT:
				UART_SendStr("TIMEOUT");
				break;
			case nRF24_TX_MAXRT:
				UART_SendStr("MAX RETRANSMIT");
				break;
			default:
				UART_SendStr("ERROR");
				break;
		}
    	UART_SendStr("\r\n");

    	// Wait ~0.5s
    	Delay_ms(500);
		
//////////////////////////RX////////////////////////////////
		
		if (nRF24_GetStatus_RXFIFO_1() != nRF24_STATUS_RXFIFO_EMPTY) {
    		// Get a payload from the transceiver
    		pipe = nRF24_ReadPayload_1(nRF24_payload_rx, &payload_length);

    		// Clear all pending IRQ flags
			nRF24_ClearIRQFlags_1();

			// Print a payload contents to UART
			UART_SendStr("RCV PIPE#");
			UART_SendInt(pipe);
			UART_SendStr(" PAYLOAD:>");
			UART_SendBufHex((char *)nRF24_payload_rx, payload_length);
			UART_SendStr("<\r\n"); 
    	}
		
//////////////////////////RX////////////////////////////////
    }

#endif // DEMO_TX_RX_SINGLE
}
